[
    {
        "title": "Food Processing and Price Patterns Across Top Food Categories",
        "year": "2025",
        "image": "../images/Food Processing and Price Patterns Across Top Food Categories.png",
        "description": "This visualization reveals that the relationship between food processing level and price is not consistent across categories. In prepared meals and snack bars, more processed foods (NOVA class 2 and 3) are often more expensive, while for cookies and candies, prices remain similar across all processing levels. These results suggest that processing level alone does not determine product price, factors such as brand or package weight also play a role. Overall, the relationship appears category-dependent rather than linear."
    },
    {
        "title": "NLP Article Review",
        "year": "2025",
        "image": "../images/NLP article review.png",
        "description": "This paper introduces a better and modular way to handle bias using 'Bias Experts'.\n Instead of correcting the main model directly, they detect and filter out biased samples first.\n The combination of modular detection + loss reweighting leads to robust and generalizable models."
    },
    {
        "title": "Iris Flower Clustering with K-Means",
        "year": "2024",
        "image": "../images/Iris Flower Clustering with K-Means.png",
        "description": "Used K-Means clustering to find natural groups of flowers in the Iris dataset based on sepal and petal features. Visualized the results with colored scatter plots showing cluster centers. The project shows how unsupervised learning can discover patterns in data without using labels."
    },
    {
        "title": "Airbnb Price Analysis in San Diego",
        "year": "2024",
        "image": "../images/Airbnb Price Analysis in San Diego.png",
        "description": "Analyzed Airbnb listings in San Diego using Python and data visualization. The histogram shows that most listings are in lower price ranges, with a few high-end outliers. This project explores local housing price distribution and highlights market imbalance between budget and luxury rentals."
    },
    {
        "title": "Weather Classification Using Decision Tree and Logistic Regression",
        "year": "2024",
        "image": "../images/Weather Classification.png",
        "description": "Compared two models, Decision Tree and Logistic Regression to predict whether the weather has high humidity. Visualized key features such as air temperature, pressure, wind speed, and rainfall."
    },
    {
        "title": "Handwritten Digit Recognition with 1-Nearest Neighbor",
        "year": "2025",
        "image": "../images/Handwriting recognize.png",
        "description": "Built a 1-Nearest Neighbor classifier on the MNIST dataset to recognize handwritten digits. For each test image, the model finds the closest training image based on pixel distance. Visualization shows the test digit and its nearest match, helping explain how simple distance-based classification works."
    },
    {
        "title": "Customer Occupation and Account Balance Analysis",
        "year": "2024",
        "image": "../images/Customer Occupation and Account Balance Analysis.png",
        "description": "Analyzed customer financial transactions to explore the relationship between occupation and account balance. Visualized distributions with boxplots and found that doctors generally hold higher balances, while students have the lowest. The results highlight how income level and spending habits vary across different occupations."
    },
    {
        "title": "Transaction Frequency Analysis by Hour",
        "year": "2024",
        "image": "../images/Transaction Frequency Analysis by Hour.png",
        "description": "Extracted hourly timestamps from transaction data to identify the most active time of day. Visualized transaction counts using bar charts, showing a strong activity peak around 4 PM followed by a sharp drop after 6 PM. This analysis helps reveal customer behavior and spending patterns throughout the day."
    },
    {
        "title": "Feature Selection for Heart Disease Prediction",
        "year": "2025",
        "image": "../images/Feature Selection for Heart Disease Prediction.png",
        "description": "Applied stepwise forward feature selection on the UCI Heart Disease dataset using logistic regression. The model iteratively chose features that minimized cross-validation error. Found that using around six features reduced the error from 0.24 to 0.16, illustrating the balance between model simplicity and predictive accuracy."
    },
    {
        "title": "Binary Perceptron Classification on Iris Dataset",
        "year": "2025",
        "image": "../images/Iris Classification with Binary Perceptron.png",
        "description": "Implemented a binary Perceptron model to classify Iris flower species using Sepal Width and Petal Width. The algorithm iteratively adjusted the decision boundary to separate the two classes. The plot shows how a simple linear classifier can effectively distinguish species in a low-dimensional space."
    },
    {
        "title": "Multiclass Classification with Linear SVM",
        "year": "2025",
        "image": "../images/Multiclass Classification with Linear SVM.png",
        "description": "Trained a multiclass Support Vector Machine (SVM) using LinearSVC on a synthetic dataset with four classes. Tested different regularization strengths (C = 0.01, 0.1, 1.0, 10.0) and visualized the decision boundaries. Found that larger C values make the model fit the training data more tightly, creating sharper boundaries."
    },
    {
        "title": "Kernel Perceptron with Quadratic Kernel",
        "year": "2025",
        "image": "../images/Kernel Perceptron with Quadratic Kernel.png",
        "description": "Used a Kernel Perceptron with a quadratic kernel to classify 2D data into two groups. The nonlinear boundary shows how kernel transformations allow linear separation in higher-dimensional space. This experiment highlights the advantage of kernel methods for nonlinearly separable data."
    }
]